# GetAllowed Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetAllowed Method
RebarShape Class See Also
---
Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public bool GetAllowed(
	RebarBarType barType
)
```

Visual Basic
---
```text
Public Function GetAllowed ( _
	barType As RebarBarType _
) As Boolean
```

Visual C++
---
```text
public:
bool GetAllowed(
	RebarBarType^ barType
)
```

# ### Parameters
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType A bar type in the same document as this shape.
# ### Return Value
True if this shape may be combined with this barType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace